# -*- coding:utf-8 -*-
'''
*
**
***
****
*****
'''
for i in range(1, 6):
    print('*'*i)
        
'''
*****
****
***
**
*
'''
print('--------')
    
for i in range(5,0, -1):
    print('*'*i)
'''
    *
   **
  ***
 ****
*****
'''
    
print('--------')

for i in range(1,6):
    print(' '*(5-i), '*'*i)


'''
*****
 ****
  ***
   **
    *
'''
    
print('--------')

for i in range(5, 0, -1):
    print(' '*(5-i), '*'*i)

'''
    *
   ***
  *****
 *******
*********
'''
print('--------')

for i in range(1, 10, 2):
    print("{:^10}".format('*'*i))
    
# "{:^10}".format('*'*i) : format안에 별 출력해줄건데 총 10칸중에 찍어줄거고, 가운데정렬해줄거야.
# "{:>10}" : 총 10칸중에 출력해줄건데 오른쪽 정렬해줄거야
# "{:<10}" : 총 10칸중에 출력해줄건데 왼족 정렬해줄거야
    
